In [34]:
import numpy as np
import pandas as pd

In [35]:
friend_dict_list=[
                  {'name': 'john','age':25, 'job': 'student'},
                  {'name': 'Nate','age':30, 'job': 'teacher'}
]

In [36]:
df=pd.DataFrame(friend_dict_list) #데이터프레임이 만들어짐

In [37]:
df.head() #정보를본다

   name  age      job
0  john   25  student
1  Nate   30  teacher

In [38]:
df=df[['name','age','job']] #원하는 순서대로 지정

In [39]:
df.head()

   name  age      job
0  john   25  student
1  Nate   30  teacher

## **OrderedDict의 사용**

데이터를 만들을때 key의 순서를 보장

In [40]:
from collections import OrderedDict

In [41]:
friend_ordered_dict=OrderedDict(
    [
     ('name', ['john','Nate']),
     ('age', ['25','30']),
     ('job', ['student','teacher']),

    ]
)

In [42]:
df=pd.DataFrame.from_dict(friend_ordered_dict)  #데이터프레임 생성

In [43]:
df.head()

   name age      job
0  john  25  student
1  Nate  30  teacher

### python의 list를 사용해서 list를 만듬

In [44]:
friend_dict_list=[
                  ['john', 20, 'student'],
                  ['Nate', 30, 'teacher']
]  # friend_dict 리스트를 만듬

In [45]:
colum_name=['name','age','job'] #colum_name을 만듬

In [46]:
df=pd.DataFrame.from_records(friend_dict_list, columns=colum_name) #데이터프레임 생성

In [47]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

## **DataFrame-items () 함수**
items () 함수는 (열 이름, 시리즈) 쌍을 반복하는 데 사용됩니다.

DataFrame 열을 반복하여 열 이름과 내용이있는 튜플을 Series로 반환합니다.

In [48]:
friend_list=[
                  ['name', ['john', 'Nate']],
                  ['age', ['20', '30']],
                  ['job', ['student', 'teacher']],
]  # friend 리스트를 만듬

In [49]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

In [53]:

for label, content in df.items():
      print('label:', label)
      print('content:', content, sep='\n')

label: name
content:
0    john
1    Nate
Name: name, dtype: object
label: age
content:
0    20
1    30
Name: age, dtype: int64
label: job
content:
0    student
1    teacher
Name: job, dtype: object

In [54]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

In [55]:
df = pd.DataFrame({'species': ['mammal', 'mammal', 'fish'],
                   'population': [3948, 4000, 6000]},
                  index=['tiger', 'fox', 'shark'])
df

      species  population
tiger  mammal        3948
fox    mammal        4000
shark    fish        6000

In [56]:
for label, content in df.items():
    print('label:', label)
    print('content:', content, sep='\n')

label: species
content:
tiger    mammal
fox      mammal
shark      fish
Name: species, dtype: object
label: population
content:
tiger    3948
fox      4000
shark    6000
Name: population, dtype: int64